src_ext/Documents/УЗ_СчетНаОплатуQR.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УЗ_СчетНаОплатуQR</Name>
			<BasedOn>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
				<xr:Item>Catalog.УЗ_Абонемент</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>140</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ПровайдерыОплатыQR</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_СтатусыОплатыQR</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторQR</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОплату</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаQR</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдОперацииБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриходДенег</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_ПриходДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_ПриходДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расшифровка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредметОбучения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/Enums/УЗ_СтатусыОплатыQR.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>УЗ_СтатусыОплатыQR</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ожидает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Истек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/Documents/УЗ_СчетНаОплатуQR/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбновитьОплатуНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ОбновитьОплатуНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ОбновитьОплатуНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "УЗ_ОплатаQR" И Параметр = Объект.Ссылка И Не Модифицированность Тогда
		Прочитать();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РасшифровкаСуммаПриИзменении(Элемент)

	Объект.СуммаДокумента = Объект.Расшифровка.Итог("Сумма");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыставитьQR(Команда)

	Если Не ЗаписатьПередДействием() Тогда
		Возврат;
	КонецЕсли;
	Результат = ВыставитьQRНаСервере();
	Если Не Результат.Успех Тогда
		ПоказатьПредупреждение(, Результат.ТекстОшибки);
		Возврат;
	КонецЕсли;
	Оповестить("УЗ_ОплатаQR", Объект.Ссылка);
	ПоказатьОповещениеПользователя(НСтр("ru = 'QR выставлен'"), , СтрШаблон(НСтр("ru = 'Действует до %1'"),
		Формат(Результат.СрокДействия, "ДФ='HH:mm dd.MM'")));

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОплату(Команда)

	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	Результат = ПроверитьОплатуНаСервере();
	Если Не ПустаяСтрока(Результат.ТекстОшибки) Тогда
		ПоказатьПредупреждение(, Результат.ТекстОшибки);
	Иначе
		ПоказатьОповещениеПользователя(НСтр("ru = 'Оплата по QR'"), , Результат.Текст);
	КонецЕсли;
	Оповестить("УЗ_ОплатаQR", Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСсылку(Команда)

	Если Объект.Ссылка.Пустая() Или Модифицированность Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Сначала выставьте QR («Выставить QR»).'"));
		Возврат;
	КонецЕсли;
	Результат = ОтправитьСсылкуНаСервере();
	Если Результат.Отправлено Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Ссылка отправлена'"), , СтрШаблон("%1: %2", Результат.Канал,
			Результат.Адрес));
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Ссылка не отправлена:'") + " " + Результат.ТекстОшибки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьQR(Команда)

	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	Результат = ОтменитьQRНаСервере();
	Если Не Результат.Успех Тогда
		ПоказатьПредупреждение(, Результат.ТекстОшибки);
	КонецЕсли;
	Оповестить("УЗ_ОплатаQR", Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДолгам(Команда)

	Если Не ЗначениеЗаполнено(Объект.Плательщик) И Объект.Расшифровка.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите плательщика или ученика в первой строке.'"));
		Возврат;
	КонецЕсли;
	Текст = ЗаполнитьПоДолгамНаСервере();
	Если Не ПустаяСтрока(Текст) Тогда
		ПоказатьПредупреждение(, Текст);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Записать счёт (новый или изменённый) перед обращением к банку; Ложь — не записался (сообщения у полей).
&НаКлиенте
Функция ЗаписатьПередДействием()

	Если Объект.Ссылка.Пустая() Или Модифицированность Тогда
		Возврат Записать();
	КонецЕсли;
	Возврат Истина;

КонецФункции

&НаСервере
Функция ВыставитьQRНаСервере()

	Результат = УЗ_ОплатыQR.ВыставитьQR(Объект.Ссылка);
	ПрочитатьОбъект();
	Возврат Результат;

КонецФункции

&НаСервере
Функция ПроверитьОплатуНаСервере()

	Проверка = УЗ_ОплатыQR.ПроверитьОплату(Объект.Ссылка);
	ПрочитатьОбъект();
	Текст = СтрШаблон(НСтр("ru = 'Статус: %1'"), Проверка.Статус);
	Если ЗначениеЗаполнено(Проверка.ПриходДенег) Тогда
		Текст = Текст + ". " + СтрШаблон(НСтр("ru = 'Приход: %1'"), Проверка.ПриходДенег);
	КонецЕсли;
	Возврат Новый Структура("ТекстОшибки, Текст", Проверка.ТекстОшибки, Текст);

КонецФункции

&НаСервере
Функция ОтправитьСсылкуНаСервере()

	Результат = УЗ_ОплатыQR.ОтправитьСсылку(Объект.Ссылка);
	Возврат Новый Структура("Отправлено, ТекстОшибки, Канал, Адрес", Результат.Отправлено, Результат.ТекстОшибки,
		Строка(Результат.Канал), Строка(Результат.Адрес));

КонецФункции

&НаСервере
Функция ОтменитьQRНаСервере()

	Результат = УЗ_ОплатыQR.ОтменитьQR(Объект.Ссылка);
	ПрочитатьОбъект();
	Возврат Новый Структура("Успех, ТекстОшибки", Результат.Успех, Результат.ТекстОшибки);

КонецФункции

&НаСервере
Функция ЗаполнитьПоДолгамНаСервере()

	Если Не УЗ_ОплатыQR.МожноМенятьСчет(Объект.Статус) Или Не ПустаяСтрока(Объект.ИдентификаторQR) Тогда
		Возврат НСтр("ru = 'QR уже выставлен — расшифровку менять нельзя. Для другой оплаты создайте новый счёт.'");
	КонецЕсли;
	Ученики = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Плательщик) Тогда
		Ученики = УЗ_ОплатыQR.УченикиДляОплаты(Объект.Плательщик);
	Иначе
		Для Каждого СтрокаОплаты Из Объект.Расшифровка Цикл
			Если ЗначениеЗаполнено(СтрокаОплаты.Ученик) И Ученики.Найти(СтрокаОплаты.Ученик) = Неопределено Тогда
				Ученики.Добавить(СтрокаОплаты.Ученик);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Строки = УЗ_ОплатыQR.СтрокиПоДолгам(Ученики, Объект.Организация);
	Если Строки.Количество() = 0 Тогда
		Возврат НСтр("ru = 'Долгов нет — укажите сумму вручную (например, оплата абонемента вперёд).'");
	КонецЕсли;
	Объект.Расшифровка.Очистить();
	Для Каждого СтрокаДолга Из Строки Цикл
		ЗаполнитьЗначенияСвойств(Объект.Расшифровка.Добавить(), СтрокаДолга);
	КонецЦикла;
	Объект.СуммаДокумента = Объект.Расшифровка.Итог("Сумма");
	Модифицированность = Истина;
	Возврат "";

КонецФункции

&НаСервере
Процедура ПрочитатьОбъект()

	ЗначениеВРеквизитФормы(Объект.Ссылка.ПолучитьОбъект(), "Объект");
	ОбновитьОплатуНаСервере();

КонецПроцедуры

//Картинка QR, доступность полей и кнопок по статусу: выставленный и оплаченный счёт не правится.
&НаСервере
Процедура ОбновитьОплатуНаСервере()

	АдресКартинки = "";
	Если Не Объект.Ссылка.Пустая() И Объект.Статус = Перечисления.УЗ_СтатусыОплатыQR.Ожидает Тогда
		Картинка = УЗ_ОплатыQR.КартинкаQR(Объект.Ссылка);
		Если Картинка <> Неопределено Тогда
			АдресКартинки = ПоместитьВоВременноеХранилище(Картинка, УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	//A10-04: после первого выставления счёт не меняется и QR заново не выставляется — новый счёт
	МожноМенять = УЗ_ОплатыQR.МожноМенятьСчет(Объект.Статус) И ПустаяСтрока(Объект.ИдентификаторQR);
	Для Каждого Имя Из СтрРазделить("Организация,Плательщик,Расшифровка,НазначениеПлатежа", ",") Цикл
		Элементы[Имя].ТолькоПросмотр = Не МожноМенять;
	КонецЦикла;
	Элементы.ЗаполнитьПоДолгам.Доступность = МожноМенять;
	Ожидает = Объект.Статус = Перечисления.УЗ_СтатусыОплатыQR.Ожидает;
	Элементы.ФормаВыставитьQR.Доступность = ПустаяСтрока(Объект.ИдентификаторQR) Или Ожидает;
	Элементы.ФормаОтправитьСсылку.Доступность = Ожидает;
	Элементы.ФормаОтменитьQR.Доступность = Ожидает;
	Элементы.КартинкаQR.Видимость = Не ПустаяСтрока(АдресКартинки);
	Элементы.ТекстОшибки.Видимость = Не ПустаяСтрока(Объект.ТекстОшибки);
	Элементы.ПриходДенег.Видимость = ЗначениеЗаполнено(Объект.ПриходДенег);
	Элементы.ДатаОплаты.Видимость = ЗначениеЗаполнено(Объект.ДатаОплаты);

КонецПроцедуры

#КонецОбласти
